# SetBoldStatus Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FormattedText..::..SetBoldStatus Method
FormattedText Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetBoldStatus(Boolean) | Sets the characters in the entire text to be bold or not bold. |
| SetBoldStatus(TextRange, Boolean) | Sets the characters in a given text range to be bold or not bold. |

# See Also
FormattedText Class
FormattedText Members
Autodesk.Revit.DB Namespace